Revit 2024 API
CurveElement Class
 Class representing curve elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class CurveElement : Element
Visual Basic
Public Class CurveElement _
	Inherits Element
Visual C++
public ref class CurveElement : public Element
Remarks
 As a base class of several specialized curved elements (such as ModelCurve, ModelLine, CurveByPoints, etc.) CurveElement exposes methods and properties of general use applicable to most kinds of curves.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.CurveByPoints
 Autodesk.Revit.DB.DetailCurve
 Autodesk.Revit.DB.ModelCurve
 Autodesk.Revit.DB.Structure.AreaReinforcementCurve
 Autodesk.Revit.DB.SymbolicCurve
See Also
CurveElement Members
Autodesk.Revit.DB Namespace